# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".


str = 'Прабвивет-омабвлет абв!'

str = str.replace('абв', "")
print(str)

